app/controllers/admin/admins_controller.rb

SELECT `admins`.* FROM `admins`
---
  def index
    @admins = Admin.all