app/controllers/admin/contents_controller.rb

SELECT  `contents`.* FROM `contents` LIMIT 5 OFFSET 0
---
  def index
    @contents = Content.paginate(:page => params[:page], :per_page => 5)