app/controllers/admin/drawdowns_controller.rb

  def index
    @drawdowns = Drawdown.paginate(:page => params[:page], :per_page => 10)
---
SELECT  `drawdowns`.* FROM `drawdowns` LIMIT 10 OFFSET 0