app/controllers/admin/users_controller.rb

SELECT  `users`.* FROM `users` LIMIT 10 OFFSET 0
---
  def index
    @users = User.paginate(:page => params[:page], :per_page => 10)