app/views/admin_users/index.html.erb

                  <td><%= user.status %></td>
                  <td><a href="<%= Medium.find(user.media_id).path.url(:original, false) %>" download>Download</a></td>
---
SELECT  `media`.* FROM `media` WHERE `media`.`id` = 3 LIMIT 1