app/controllers/admins_controller.rb

  def index
    @admins = Admin.all
---
SELECT `admins`.* FROM `admins`

  def create
    @admin = Admin.new(admin_params)

    respond_to do |format|
      if @admin.save
---
INSERT INTO `admins` (`username`, `password`, `status`, `created_at`, `updated_at`) VALUES ('admin', '202cb962ac59075b964b07152d234b70', 1, '2016-08-23 04:35:08', '2016-08-23 04:35:08')

  def update
    respond_to do |format|
      if @admin.update(admin_params)
---
UPDATE `admins` SET `password` = 'd41d8cd98f00b204e9800998ecf8427e', `updated_at` = '2016-08-23 07:25:40' WHERE `admins`.`id` = 3

    def set_admin
      @admin = Admin.find(params[:id])
---
SELECT  `admins`.* FROM `admins` WHERE `admins`.`id` = 3 LIMIT 1