app/controllers/admin_drawdowns_controller.rb

SELECT  `drawdowns`.* FROM `drawdowns` LIMIT 10 OFFSET 0
---
  def index
    @drawdowns = Drawdown.paginate(:page => params[:page], :per_page => 10)