app/controllers/admin_users_controller.rb

SELECT  `users`.* FROM `users` LIMIT 10 OFFSET 0
---
  def index
    @users = User.paginate(:page => params[:page], :per_page => 10)

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 65 LIMIT 1
UPDATE `users` SET `status` = 1, `updated_at` = '2016-08-23 09:43:26' WHERE `users`.`id` = 65
---
  def update
    # binding.pry
    @user = User.find(params[:id])
    respond_to do |format|
      if @user.update(user_params)