app/controllers/contents_controller.rb

SELECT  `contents`.* FROM `contents` LIMIT 10 OFFSET 0
---
  def index
    @contents = Content.paginate(:page => params[:page], :per_page => 5)

INSERT INTO `contents` (`title`, `description`, `content`, `status`, `type`, `created_at`, `updated_at`) VALUES ('blabla', 'aaaa', 'sdasdasd', 1, 1, '2016-08-23 07:08:08', '2016-08-23 07:08:08')
---
  def create
    @content = Content.new(content_params)

    respond_to do |format|
      if @content.save

UPDATE `contents` SET `type` = 2, `updated_at` = '2016-08-23 06:58:23' WHERE `contents`.`id` = 1
---
  def update
    respond_to do |format|
      if @content.update(content_params)

SELECT  `contents`.* FROM `contents` WHERE `contents`.`id` = 1 LIMIT 1
---
    def set_content
      @content = Content.find(params[:id])