app/controllers/register_controller.rb

INSERT INTO `users` (`email`, `active_code`, `status`, `created_at`, `updated_at`) VALUES ('ngockien16dev@gmail.com', '614854', 0, '2016-08-22 08:14:08', '2016-08-22 08:14:08')
---
  def create
    # binding.pry
    @params = params[:user]
    @user = User.new(:email => @params['email'], :active_code => rand(111111...999999),:status => 0)
    respond_to do |format|
      if @user.save

UPDATE `users` SET `status` = 1, `updated_at` = '2016-08-22 08:19:18' WHERE `users`.`id` = 49
---
  def create_active_code
    @result = User.check_active_code(user_params)
    if @result
      #check success
      @result.update(:status => 1)