app/controllers/users_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 61 LIMIT 1
---
  def show
    @menu_active = 'user'
    @numberNotification = Notification.get_notifications(0, session[:user_id]).count
    @user = User.find(params[:id])

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 64 LIMIT 1
UPDATE `users` SET `password` = '123123', `name` = 'Tran Ngoc Kien', `phone` = 973511240, `passport` = '017020472', `gender` = 1, `address` = 'Sai Son - Quoc Oai - Ha noi', `provined_id` = 0, `district_id` = 0, `ward_id` = 0, `updated_at` = '2016-08-23 03:28:40' WHERE `users`.`id` = 64
INSERT INTO `media` (`path_file_name`, `path_content_type`, `path_file_size`, `path_updated_at`, `created_at`, `updated_at`) VALUES ('88-avatars.alphacoders.com.jpg', 'image/jpeg', 20000, '2016-08-23 03:55:37', '2016-08-23 03:55:37', '2016-08-23 03:55:37')
---
  def update
    @user = User.find(params[:id])
    @birthday = params[:date]['day']+"/"+params[:date]['month']+"/"+params[:date]['year']
    @params = params[:user]
    @params['birthday'] = @birthday
    # binding.pry
    respond_to do |format|
      # check change email
      if @user.by_social == 1
        # binding.pry
        if user_params['email'] != @user.email
          # ko dc phep doi tiep
          @user_params = user_params.merge(change_email: 1)
          @user_update = @user.update(@user_params)
        else
          # dc phep doi tiep
          @user_params = user_params.merge(change_email: 0)
          @user_update = @user.update(@user_params)
        end
      else
        @user_update = @user.update(user_params)
      end
      if @user_update
        # upload document user here
        if params[:document]
          # binding.pry
          @media = Medium.create(path: params[:document])